Dlubal.TimberPro.IModuleCase
Interface for working with module case.

Dlubal.TimberPro.IModuleCase.GetMemberCount
Gets count of members selected for the design.
Returns: Count of members

Dlubal.TimberPro.IModuleCase.GetMemberList
Gets list of members used for the design.
Returns: List of members used for design. Allowed values: "1,2,3"; "1-5"; "1-3,5"

Dlubal.TimberPro.IModuleCase.SetMemberList(System.String)
Sets list of members used for the design.
Members: List of members used for the design. Allowed values: "1,2,3"; "1-5"; "1-3,5"; "all"

Dlubal.TimberPro.IModuleCase.GetMemberSetCount
Gets count of sets of members selected for the design.
Returns: Count of sets of members.

Dlubal.TimberPro.IModuleCase.GetMemberSetList
Gets list of sets of members used for the design.
Returns: List of sets of members used for the design. Allowed values: "1,2,3"; "1-5"; "1-3,5"

Dlubal.TimberPro.IModuleCase.SetMemberSetList(System.String)
Sets list of sets of members used for design.
Sets: List of sets of members used for design. Allowed values: "1,2,3"; "1-5"; "1-3,5"; "all"

Dlubal.TimberPro.IModuleCase.GetNationalAnnex
Gets current national annex.
Returns: Get current national annex

Dlubal.TimberPro.IModuleCase.SetNationalAnnex(System.UInt32@)
Sets national annex.
Annex: National Annex

Dlubal.TimberPro.IModuleCase.GetServiceClassDetails
Get details of service class selection
Returns: Details of service class selection

Dlubal.TimberPro.IModuleCase.SetServiceClassDetails(System.UInt32@)
Set details of service class selection
Details: Details of service class selection

Dlubal.TimberPro.IModuleCase.GetMaterialCount
Gets count of materials.
Returns: Count of materials

Dlubal.TimberPro.IModuleCase.GetMaterial(System.Int32,System.UInt32)
Gets material.
Returns: Material parameters.
No: Number or index of the material you want to get.
At: Specifies the type of access.

Dlubal.TimberPro.IModuleCase.SetMaterial(System.Int32,System.UInt32,System.UInt32@)
Sets material.
No: Number or index of the material you want to set.
At: Specifies the type of access.
Material: Material parameters

Dlubal.TimberPro.IModuleCase.GetMaterials
Gets all materials.
Returns: Array of all materials

Dlubal.TimberPro.IModuleCase.SetMaterials(System.UInt32@)
Sets materials.
Materials: Array of materials you want to set.

Dlubal.TimberPro.IModuleCase.GetCrossSectionCount
Gets count of cross-sections.
Returns: Count of cross-sections

Dlubal.TimberPro.IModuleCase.GetCrossSection(System.Int32,System.UInt32)
Gets cross-section.
Returns: Cross-section parameters.
No: Number or index of the cross-section you want to get.
At: Specifies the type of access.

Dlubal.TimberPro.IModuleCase.SetCrossSection(System.Int32,System.UInt32,System.UInt32@)
Sets cross-section.
No: Number or index of the cross-section you want to set.
At: Specifies the type of access.
CrossSection: Cross-section parameters

Dlubal.TimberPro.IModuleCase.GetCrossSections
Gets all cross-sections.
Returns: Array of all cross-sections

Dlubal.TimberPro.IModuleCase.SetCrossSections(System.UInt32@)
Sets cross-sections.
CrossSections: Array of cross-sections you want to set.

Dlubal.TimberPro.IModuleCase.GetMemberEffectiveLengthCount
Gets count of members effective lengths.
Returns: Count of members effective lengths

Dlubal.TimberPro.IModuleCase.GetMemberEffectiveLength(System.Int32,System.UInt32)
Gets member effective length.
Returns: Member effective length parameters.
No: Number or index of the member effective length you want to get.
At: Specifies the type of access.

Dlubal.TimberPro.IModuleCase.SetMemberEffectiveLength(System.Int32,System.UInt32,System.UInt32@)
Sets member effective length.
No: Number or index of the members effective length you want to set.
At: Specifies the type of access.
Length: Members effective length parameters

Dlubal.TimberPro.IModuleCase.GetMembersEffectiveLengths
Gets members effective lengths.
Returns: Array of all members effective lengths

Dlubal.TimberPro.IModuleCase.SetMembersEffectiveLengths(System.UInt32@)
Sets members effective lengths.
Lengths: Array of members effective lengths you want to set.

Dlubal.TimberPro.IModuleCase.GetSetEffectiveLengthCount
Gets count of sets of members effective lengths.
Returns: Count of sets of members effective lengths

Dlubal.TimberPro.IModuleCase.GetSetEffectiveLength(System.Int32,System.UInt32)
Gets set of members effective length.
Returns: Set of members effective length parameters.
No: Number or index of the set of members effective length you want to get.
At: Specifies the type of access.

Dlubal.TimberPro.IModuleCase.SetSetEffectiveLength(System.Int32,System.UInt32,System.UInt32@)
Sets set of members effective length.
No: Number or index of the set of members effective length you want to set.
At: Specifies the type of access.
Length: Set of members effective length parameters

Dlubal.TimberPro.IModuleCase.GetSetsEffectiveLengths
Gets sets of members effective lengths.
Returns: Array of all sets of members effective lengths.

Dlubal.TimberPro.IModuleCase.SetSetsEffectiveLengths(System.UInt32@)
Sets sets of members effective lengths.
Lengths: Array of sets of members effective lengths.

Dlubal.TimberPro.IModuleCase.GetServiceabilityCount
Gets count of serviceability.
Returns: Count of serviceability

Dlubal.TimberPro.IModuleCase.GetServiceability(System.Int32,System.UInt32)
Gets serviceability.
Returns: Serviceability parameters
No: Number or index of the set of members effective length you want to get.
At: Specifies the type of access.

Dlubal.TimberPro.IModuleCase.SetServiceability(System.Int32,System.UInt32,System.UInt32@)
Sets serviceability.
No: Number or index of the set of members effective length you want to set.
At: Specifies the type of access.
Data: Serviceability parameters.

Dlubal.TimberPro.IModuleCase.GetServiceabilities
Gets all serviceability parameters.
Returns: Array of all serviceability parameters.

Dlubal.TimberPro.IModuleCase.SetServiceabilities(System.UInt32@)
Sets all serviceability parameters.
Data: Array of serviceability parameters.

Dlubal.TimberPro.IModuleCase.DeleteServiceability(System.Int32,System.UInt32)
Deletes serviceability parameters.
No: Number or index of the set of members effective length you want to set.
At: Specifies the type of access.

Dlubal.TimberPro.IModuleCase.GetMemberFireResistanceCount
Gets count of fire resistance parameters for members.
Returns: Count of fire resistance parameters

Dlubal.TimberPro.IModuleCase.GetMemberFireResistance(System.Int32,System.UInt32)
Gets fire resistance parameters for a member.
Returns: Member fire resistance parameters.
No: Number or index of the set of members effective length you want to get.
At: Specifies the type of access.

Dlubal.TimberPro.IModuleCase.SetMemberFireResistance(System.Int32,System.UInt32,System.UInt32@)
Sets fire resistance parameters for a member.
No: Number or index of the set of members effective length you want to set.
At: Specifies the type of access.
Resistance: Fire resistance parameters of members

Dlubal.TimberPro.IModuleCase.GetMembersFireResistances
Gets fire resistance parameters for all members.
Returns: Array of all fire resistance parameters

Dlubal.TimberPro.IModuleCase.SetMembersFireResistances(System.UInt32@)
Sets fire resistance parameters for all members.
Resistance: Array of all fire resistance parameters

Dlubal.TimberPro.IModuleCase.DeleteMemberFireResistance(System.Int32,System.UInt32)
Deletes member fire resistance parameters.
No: Number or index of the set of members effective length you want to set.
At: Specifies the type of access.

Dlubal.TimberPro.IModuleCase.GetSetFireResistanceCount
Gets count of fire resistance parameters for sets of members.
Returns: Count of fire resistance parameters

Dlubal.TimberPro.IModuleCase.GetSetFireResistance(System.Int32,System.UInt32)
Gets fire resistance parameters for a set of members.
Returns: Member fire resistance parameters
No: Number or index of the set of members
At: Specifies the type of access

Dlubal.TimberPro.IModuleCase.SetSetFireResistance(System.Int32,System.UInt32,System.UInt32@)
Sets fire resistance parameters for set of members.
No: Number or index of the set of members
At: Specifies the type of access
Resistance: Fire resistance parameters

Dlubal.TimberPro.IModuleCase.GetSetsFireResistances
Gets fire resistance parameters for all sets of members.
Returns: Array of all fire resistance parameters.

Dlubal.TimberPro.IModuleCase.SetSetsFireResistances(System.UInt32@)
Sets fire resistance parameters for all sets of members.
Resistance: Array of fire protection for all sets of members.

Dlubal.TimberPro.IModuleCase.DeleteSetFireResistance(System.Int32,System.UInt32)
Deletes set fire resistance parameters.
No: Number or index of the set of members fire resistance.
At: Specifies the type of access.

Dlubal.TimberPro.IModuleCase.GetTaperDetailCount
Gets count of taper parameters.
Returns: Count of taper parameters

Dlubal.TimberPro.IModuleCase.GetTaperDetail(System.Int32,System.UInt32)
Gets taper detail.
Returns: Taper detail.
No: Number or index of the detail
At: Specifies the type of access.

Dlubal.TimberPro.IModuleCase.SetTaperDetail(System.Int32,System.UInt32,System.UInt32@)
Sets taper detail.
No: Number or index of the detail
At: Specifies the type of access
Detail: Structure with taper detail

Dlubal.TimberPro.IModuleCase.GetTapersDetails
Gets tapered members details.
Returns: Array of all taper details.

Dlubal.TimberPro.IModuleCase.SetTapersDetails(System.UInt32@)
Gets tapered members details.
Detail: Array of all taper details.

Dlubal.TimberPro.IModuleCase.GetCurvedMemberDetailCount
Gets count of curved members.
Returns: Count curved members parameters

Dlubal.TimberPro.IModuleCase.GetCurvedMemberDetailEC5(System.Int32,System.UInt32)
Gets curved member detail for standard EC5.
Returns: Curved member detail for standard EC5
No: Number or index of the detail
At: Specifies the type of access

Dlubal.TimberPro.IModuleCase.GetCurvedMemberDetailDIN(System.Int32,System.UInt32)
Gets curved member detail for standard DIN.
Returns: Curved member detail for standard DIN.
No: Number or index of the detail
At: Specifies the type of access.

Dlubal.TimberPro.IModuleCase.GetCurvedMemberDetailSIA(System.Int32,System.UInt32)
Gets curved member detail for standard SIA.
Returns: Curved member detail for standard SIA.
No: Number or index of the detail
At: Specifies the type of access.

Dlubal.TimberPro.IModuleCase.SetCurvedMemberDetailEC5(System.Int32,System.UInt32,System.UInt32@)
Sets curved member detail for standard EC5.
No: Number or index of the detail
At: Specifies the type of access.
Detail: Curved member detail for standard EC5.

Dlubal.TimberPro.IModuleCase.SetCurvedMemberDetailDIN(System.Int32,System.UInt32,System.UInt32@)
Sets curved member detail for standard DIN.
No: Number or index of the detail
At: Specifies the type of access.
Detail: Curved member detail for standard DIN.

Dlubal.TimberPro.IModuleCase.SetCurvedMemberDetailSIA(System.Int32,System.UInt32,System.UInt32@)
Sets curved member detail for standard SIA.
No: Number or index of the detail
At: Specifies the type of access.
Detail: Curved member detail for standard SIA.

Dlubal.TimberPro.IModuleCase.GetCurvedMemberDetailsEC5
Gets curved members details for the standard EC5.
Returns: Array of all curved members details for standard EC5.

Dlubal.TimberPro.IModuleCase.GetCurvedMemberDetailsDIN
Gets curved members details for the standard DIN.
Returns: Array of all curved members details for standard DIN.

Dlubal.TimberPro.IModuleCase.GetCurvedMemberDetailsSIA
Gets curved members details for the standard SIA.
Returns: Array of all curved members details for standard SIA.

Dlubal.TimberPro.IModuleCase.SetCurvedMemberDetailsEC5(System.UInt32@)
Sets curved members details for the standard EC5.
Detail: Array of curved member details.

Dlubal.TimberPro.IModuleCase.SetCurvedMemberDetailsDIN(System.UInt32@)
Sets curved members details for the standard DIN.
Detail: Array of curved member details.

Dlubal.TimberPro.IModuleCase.SetCurvedMemberDetailsSIA(System.UInt32@)
Sets curved members details for the standard SIA.
Detail: Array of curved member details.

Dlubal.TimberPro.IModuleCase.GetLoadDurationDetailCount
Gets count of load duration records.
Returns: Count of load duration records

Dlubal.TimberPro.IModuleCase.GetLoadDurationDetail(System.Int32,System.UInt32)
Gets load duration detail.
Returns: Load duration detail
No: Number of the loading
Type: Type of the loading

Dlubal.TimberPro.IModuleCase.SetLoadDurationDetail(System.UInt32@)
Sets load duration detail.
Detail: Load duration detail

Dlubal.TimberPro.IModuleCase.GetLoadDurationDetails
Gets load duration details.
Returns: Array of all load duration details.

Dlubal.TimberPro.IModuleCase.SetLoadDurationDetails(System.UInt32@)
Sets load duration details.
Detail: Array of all load duration details.

Dlubal.TimberPro.IModuleCase.GetULSOptions
Gets ultimate limit state options.
Returns: Ultimate limit state options.

Dlubal.TimberPro.IModuleCase.SetULSOptions(System.UInt32@)
Sets ultimate limit state options.
Options: Ultimate limit state options

Dlubal.TimberPro.IModuleCase.GetStabilityOptions
Gets stability options.
Returns: Stability options

Dlubal.TimberPro.IModuleCase.SetStabilityOptions(System.UInt32@)
Sets stability options.
Options: Stability options

Dlubal.TimberPro.IModuleCase.GetSLSOptions
Gets serviceability limit state options.
Returns: Serviceability limit state options

Dlubal.TimberPro.IModuleCase.SetSLSOptions(System.UInt32@)
Sets serviceability limit state options.
Options: Serviceability limit state options

Dlubal.TimberPro.IModuleCase.GetFireResistanceOptions
Gets fire resistance options.
Returns: Fire resistance options

Dlubal.TimberPro.IModuleCase.SetFireResistanceOptions(System.UInt32@)
Sets fire resistance options.
Options: Fire resistance options

Dlubal.TimberPro.IModuleCase.GetOtherOptions
Gets other options.
Returns: Other options

Dlubal.TimberPro.IModuleCase.SetOtherOptions(System.UInt32@)
Sets other options.
Options: Other options

Dlubal.TimberPro.IModuleCase.Calculate
Calculates results of the module case.
Returns: Array of errors that occurred during the calculation.

Dlubal.TimberPro.IModuleCase.GetResults
Gets results.
Returns: Interface for working with results.

Dlubal.TimberPro.IModuleCase.DeleteResults
Deletes results.